{
  "training": {
    "courses" : [
      {
        "name" : "SAF User Class (New!)",
        "course_link" : "https://mitre-saf-training.netlify.app/",
        "desc" : "This class provides understanding and hands-on practical use of MITRE's Security Automation Framework with a focus on automating security validation and visualization.",
        "bullets" : [
          "Identify and locate security guidance for a software component",
          "Understand the capabilities available in the main pillars of the MITRE Security Automation Framework - Plan, Harden, Validate, Normalize, Visualize",
          "Visualize InSpec results and third party security tool data",
          "Define and run an InSpec profile to validate a component against a security guide",
          "Automatically export checklist results from a security assessment"
        ]
      },
      {
        "name" : "Inspec Profile Developer Class",
        "course_link" : "https://mitre-saf-training.netlify.app/",
        "desc" : "This course teaches the basics of writing and running InSpec test profiles. Note that basic knowledge of Ruby and CLI familiarity is required.",
        "video_link" : "https://www.youtube.com/watch?v=KOQbSI6wWUk&list=PLkTApXQou_8LsM26IAZjQsdaDNvsnTWjB&index=1",
        "bullets" : [
          "Learn about the InSpec framework and its capabilities",
          "Write your own test profiles to learn InSpec profile architecture and best practices",
          "Report, view, and analyze InSpec test results"
        ]
      },
      {
        "name" : "Inspec Advanced Developer Class",
        "course_link" : "https://mitre-saf-training.netlify.app/",
        "desc" : "This course provides a deep dive into InSpec's advanced capabilities.",
        "video_link" : "https://www.youtube.com/watch?v=hkd0fbk9efo&list=PLkTApXQou_8LsM26IAZjQsdaDNvsnTWjB&index=3",
        "bullets" : [
          "Learn to use profile inheritance techniques to run multiple profiles against a target",
          "Develop your own InSpec resource objects to cover application stack components",
          "Expand your test-writing skills to handle more use cases",
          "Automate security testing via integration in a CI/CD pipeline"
        ]
      },
      {
        "name" : "COMING SOON! Security Guidance Developer Class",
        "desc" : "This course looks at MITRE SAF's resources in the planning stage of the security validation process.",
        "bullets" : [
          "Learn to choose, tailor, and create security guidance appropriate for your mission",
          "Develop security guidance using the MITRE Vulcan application",
          "Use Heimdall to review, edit, or export guidance information for security assessment"
        ]
      }
    ]
  }
}